# -*- coding: utf-8 -*-
# @Author: Administrator
# @Date:   2018-05-10 09:36:59
# @Last Modified by:   Administrator
# @Last Modified time: 2018-05-10 10:03:39

# 十六进制用0x前缀和0-9，a-f表示，例如：0xff00，0xa5b4c3d2

r'''
对于很大或很小的浮点数，就必须用科学计数法表示，把10用e替代
1.23x109就是1.23e9，或者12.3e8，0.000012可以写成1.2e-5
'''

# 转义字符\可以转义很多字符，比如\n表示换行，\t表示制表符，字符\本身也要转义，所以\\表示的字符就是\
# 如果字符串里面有很多字符都需要转义，就需要加很多\，为了简化，Python还允许用r''表示''内部的字符串默认不转义
# 如果字符串内部有很多换行，用\n写在一行里不好阅读，为了简化，Python允许用'''...'''的格式表示多行内容

n = 123
f = 456.789
s1 = 'Hello, world'
s2 = 'Hello, \'Adam\''
s3 = r'Hello, "Bart"'
s4 = r'''Hello,
Lisa!'''